import 'package:flutter/material.dart';

class Bollinger extends StatelessWidget {
  //final ScrollController _scrollController = ScrollController();
  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.only(right: 25.0, left: 8),
      child: Column(
        children: [
          Container(
            alignment: Alignment.centerRight,
            child: Text(
              'اندیکاتور باند بولینگر مثل اغلب اندیکاتورهای دیگر یک ابزار واکنش‌گرا و تاخیری (Lagging) به شمار میرود و نمیتوان از آن برای پیش‌بینی حرکت قیمت در آینده استفاده کرد.' +
                  '\n' +
                  'خط میانی اندیکاتور باند بولینگر بر اساس میانگین متحرک ساده (SMA) طراحی شده است که اغلب با دوره زمانی ۲۰ مورد استفاده قرار می‌گیرد.' +
                  '\n' +
                  'باند بالایی و پایینی از انحراف معیار خط میانی محاسبه میشوند و برای سنجش نوسانات صعودی و نزولی به کار می‌روند.' +
                  '\n' +
                  'باند بولینگر می‌تواند در درک این که آیا سهام در حال رشد است یا خیر یا حتی نوسان کافی برای سرمایه‌گذاری وجود دارد، به شما کمک کند.' +
                  '\n',
              style: TextStyle(color: Colors.black),
            ),
          ),
          Padding(
            padding: const EdgeInsets.only(left: 25.0, bottom: 20, top: 10),
            child: Center(
              child: Image(
                image: AssetImage(
                    'assets/images/indicators/charts/bollingerChart.png'),
              ),
            ),
          ),
          Text(
            '\n' +
                'بزرگترین اشتباهی که معامله‌گران مبتدی هنگام استفاده از باند بولینگر انجام می‌دهند این است که وقتی قیمت به باند بالایی برخورد می‌کند، سهام را می‌فروشند و زمانی که قیمت به باند پایینی برخورد می‌کند، می خرند.' +
                '\n' +
                'در واقع شکست باندهای بالایی و یا پایینی بولینگر هیچ سرنخی در مورد بازگشت روند و میزان حرکت روند بازگشتی ارائه نمیکند.  باندهای بولینگر به هیچ عنوان به تنهایی  مبنای تصمیم گیری برای خرید و فروش نیست و بهتر است در کنار اندیکانورهای MACD و RSI مورد استفاده قرار گیرد.' +
                '\n'
                    'در مواقعی که بازار خنثی است باندها به هم نزدیک است و  زمانی که قیمت‌ها روند صعودی و یا نزولی پیدا میکنند باندها از یکدیگر دور میشوند.' +
                '\n' +
                'استراتژی‌های معاملاتی باند بولینگر:' +
                '\n' +
                '- زمانیکه بازار خنثی است باندهای بالایی و پایینی  بعنوان نقاط مقاومت و حمایت شناخته میشوند.' +
                '\n' +
                '- زمانیکه کندل قیمت‌ها از باندهای بالایی یا پایینی تجاوز کند نشاندهنده ورود به منطقه اشباع است و هشدار برگشت روند صادر میشود.' +
                '\n' +
                '- زمانیکه باندهای بالایی و پایینی به خط  میانی نزدیک و فشرده شوند نشاندهنده آغاز روند صعودی یا نزولی جدید در آینده است.' +
                '\n' +
                '- اگر روند صعودی باشد، کندل ها حتما به باند بالایی خواهند رسید و این یک فرصت خوب برای خرید هست.' +
                '\n' +
                '- اگر در یک روند صعودی پول بکی به خط میانی بولینگر باند زده شود، یک سیگنال خرید صادر میشود.' +
                '\n' +
                '- در یک روند صعودی کندل ها نباید باند پایین بولینگر را تاچ کنند و در صورتی که این اتفاق بیفتد هشدار تغییر روند صادر میشود.' +
                '\n' +
                '- الگوی کف دو قلو رو میتوان با باند بولینگر ترکیب کرد. به این شکل که کف دوم میبایست پایینتر از کف اول و بالاتر از باند پایینی بولینگر شکل بگیرد. در ادامه وقتی قیمت به سمت بالا حرکت میکند و به بالای قله قبلی میرسد، در نقطه پول بک سیگنال خرید صادر میشود.',
            style: TextStyle(color: Colors.black),
          ),
        ],
      ),
    );
  }
}
