import 'package:flutter/material.dart';

class Macd extends StatelessWidget {
  //final ScrollController _scrollController = ScrollController();
  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.only(right: 25.0, left: 8),
      child: Column(
        crossAxisAlignment: CrossAxisAlignment.start,
        children: [
          Text(
            'Moving Average Convergence/Divergence' +
                '\n' +
                ' اندیکاتور میانگین متحرک همگرایی/ واگرایی' +
                '\n',
            style: TextStyle(color: Colors.black),
            textAlign: TextAlign.right,
          ),
          Text(
            'MACD یک اندیکاتور مونتوم و تعقیب کننده روند میباشد.' +
                '\n' +
                'این اندیکاتور با توجه به ماهیت میانگین‌های متحرک، در دسته اندیکاتورهای تاخیری (Lagging) قرار میگیرد.' +
                '\n' +
                'این اندیکاتور از سه جزء تشکیل شده است:' +
                '\n' +
                '- خط MACD' +
                '\n' +
                '- خط Signal ' +
                '\n' +
                '- هیستوگرام' +
                '\n',
            style: TextStyle(color: Colors.black),
          ),
          Padding(
            padding: const EdgeInsets.only(left: 25.0, bottom: 20, top: 10),
            child: Center(
              child: Image(
                image:
                    AssetImage('assets/images/indicators/charts/macdChart.jpg'),
              ),
            ),
          ),
          Text(
            ' خط MACD: از طریق کم کردن میانگین متحرک نمایی 26 دوره‌ای قیمت از میانگین متحرک نمایی 12 دوره‌ای قیمت محاسبه می‌شود. ' +
                '\n' +
                'خط Signal: میانگین متحرک نمایی 9 دوره‌ای خط MACD.' +
                '\n' +
                'اگر خط مکدی بالای صفر باشد و در حال افزایش یافتن باشد، نشان از بالا رفتن مومنتوم روند صعودی میدهد و در صورتی که خط مکدی در حال کاهش و نزدیک شدن به صفر باشد، نشان از کم شدن مومنتوم روند صعودی است.' +
                '\n' +
                'اگر خط مکدی زیر صفر باشد و در حال کاهش یافتن باشد، نشان از بالا رفتن مومنتوم روند نزولی میدهد و در صورتی که خط مکدی در حال افزایش و نزدیک شدن به صفر باشد، نشان از کم شدن مومنتوم روند نزولی است.' +
                '\n' +
                'اندیکاتور مکدی اغلب با نمودار میله‌ای به نام هیستوگرام بر روی خود همراه است که نشان‌دهنده‌ی فاصله‌ی بین خط MACD و خط Signal است.' +
                '\n' +
                'معمولا پارامترهای زمانی این نمودار به صورت پیش فرض با اعداد ۹ ۲۶ ۱۲ مشخص می‌شوند. تحلیلگرانی که به دنبال حساسیت بیشتری در اندیکاتور مکدی خود هستند، می‌توانند اعداد دیگری را برای تنظیمات اندیکاتور انتخاب کنند. برای مثال (MACD (۵،۳۵،۵ نسبت به (MACD (۱۲،۲۶،۹ حساس تر است و برای تایم فریم های بزرگتری مانند تایم‌فریم هفتگی می‌تواند مناسب‌تر عمل کند. ',
            style: TextStyle(color: Colors.black),
          ),
          Text(
            'هنگامی که میله‌های هیستوگرام در بالای صفر شروع به بزرگ شدن می‌کنند روند صعودی در حال قوی شدن است و در مقابل هنگامی که شروع به کوچک شدن می‌کنند، روند صعودی در حال تضعیف است. برعکس آن زمانی است که هیستوگرام در زیر خط صفر قرار دارد و منفی است. در این شرایط نیز بزرگ و کوچک شدن میله‌ها نشان از تقویت و تضعیف روند نزولی دارد.' +
                '\n' +
                'هنگامی که MACD از خط سیگنال پایین‌تر می‌رود به منزله زمان مناسب برای فروش است. ' +
                '\n' +
                'هنگامی که MACD از خط سیگنال بالاتر می‌رود به منزله زمان مناسب برای خرید است.' +
                '\n' +
                'برخی معامله‌گران برای کاهش احتمال فریب خوردن و ورود زودهنگام به موقعیت معاملاتی، منتظر ایجاد تقاطعی تائید شده بالای خط صفر می‌مانند. ' +
                '\n' +
                'یکی از اصلی ترین کاربردهای مکدی، مشاهده‌ی واگرایی‌ها بین قیمت و اندیکاتور مکدی است. واگرایی‌ها زمانی اتفاق می‌افتند که روند قیمتی خلاف روند MACD باشد',
            style: TextStyle(color: Colors.black),
          ),
        ],
      ),
    );
  }
}
