import 'package:flutter/material.dart';

class Rsi extends StatelessWidget {
  //final ScrollController _scrollController = ScrollController();
  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.only(right: 25.0, left: 8),
      child: Column(
        children: [
          Container(
            alignment: Alignment.centerRight,
            child: Text(
              'مخفف عبارت Relative Strength Index',
              style: TextStyle(
                color: Colors.black,
              ),
            ),
          ),
          Text(
            'RSI یکی از اندیکاتورهای مومنتوم و پیشرو است که با استفاده از آن میتوانیم سرعت و میزان حرکت قیمت را اندازه گیری کنیم. ' +
                '\n',
            style: TextStyle(color: Colors.black),
          ),
          Padding(
            padding: const EdgeInsets.only(left: 25.0, bottom: 20, top: 10),
            child: Center(
              child: Image(
                image:
                    AssetImage('assets/images/indicators/charts/rsiChart.png'),
              ),
            ),
          ),
          Text(
            'فرمول محاسباتی RSI بر مبنای محاسبه میانگین سود و ضرر در یک بازه زمانی مشخص است. بازه زمانی پیشفرض برای این اسیلاتور 14 میباشد. هر چه میزان این بازه زمانی بیشتر باشد، مقادیر محاسبه شده دقیق‌تر و حساسیت کمتر میشوند. عکس این موضوع نیز صادق است. این یعنی اینکه RSI 10 روزه نسبت به RSI 20 روزه احتمال بیشتری دارد که زودتر به سطوح اشباع خرید/فروش برسد.' +
                '\n' +
                'این اسیلاتور بین دو سطح 0 و 100 در نوسان می باشد. در این بین، دو سطح کلیدی 30 و 70 به ترتیب به عنوان سطوح اشباع فروش و اشباع خرید نامیده میشوند. به این معنی که هر گاه مقدار RSI از عدد 30 کمتر شود شاهد فروش های افراطی در بازار هستیم و لذا احتمال کاهش فشار فروش و صعود قیمت وجود دارد. بر عکس، عبور RSI از سطح 70 به سمت بالا به معنی انجام خریدهای افراطی در بازار می باشد که در نهایت این خریدها ممکن است هر لحظه به پایان رسیده و شاهد نزول قیمت باشیم. توجه داشته باشید که بهترین حالت برای دریافت سیگنال از این روش در روندهای رنج یا خنثی است.' +
                '\n' +
                'مشاهده واگرایی در این اسیلاتور منجر به صدور سیگنال های معتبر برگشت روند میشود. البته استفاده از این روش در روندهای پر قدرت ممکن است منحر به دریافت سیگنالهای اشتباه شود. یعنی با وجود مشاهده واگرایی، بازگشت روندی در عمل صورت نمیگیرد و فقط شاهد یک اصلاح کوتاه مدتی خواهیم بود. در مواقعی که شاهد یک روند پر قدرت صعودی هستیم RSI تمایل دارد در محدوده 40 تا 90 در نوسان باشد. در این صورت منطقه 40 تا 50 بعنوان یک سطح حمایتی عمل میکند که میتوان از آن بعنوان نقاط ورود کم ریسک استفاده کرد. همچنین در یک روند پر قدرت نزولی RSI تمایل دار در محدوده 10 تا 60 در نوسان باشد. در این صورت  منطقه 50 تا 60 به عنوان یک سطح مقاومتی عمل میکند.' +
                '\n' +
                'معمولا واگرایی های معمولی مثبت در منطقه اشباع فروش و واگرایی معمولی منفی در منطقه اشباع خرید معتبر هستند. همچنین واگرایی مخفی مثبت در محدوده 30 تا 50 و واگرایی مخفی منفی در محدوده 50 تا 70 از درجه اعتبار برخوردار هستند.' +
                '\n' +
                'یکی از روشهای ایده‌آل برای دریافت سیگنال معتبر با استفاده از اسیلاتور RSI روشی است به نام Failure Swings. ' +
                ' در این روش برای دریافت سیگنال خرید 3 شرط لازم است:' +
                '\n' +
                '1- در حالی که مقدار RSI در محدوده اشباع فروش است یک جهش به بیرون از این محدوده داشته باشد.' +
                '\n' +
                '2- مشاهده یک پولبک به خط مرزی 30' +
                '\n' +
                '3- شکست قله قبلی در اندیکاتور RSI' +
                '\n\n' +
                'بر عکس موارد بالا را میتوان برای دریافت سیگنال فروش استفاده کنید.' +
                '\n' +
                'واچ لیست ارائه شده، نمادهایی را که به بیرون از محدوده اشباع فروش جهیده‌اند را نمایش میدهد. لطفا برای تایید سیگنال‌ها، موارد ذکر شده در متن آموزشی را در نظر داشته باشید. ',
            style: TextStyle(color: Colors.black),
          ),
        ],
      ),
    );
  }
}
