import 'package:flutter/material.dart';

class Stochastic extends StatelessWidget {
  //final ScrollController _scrollController = ScrollController();
  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.only(right: 25.0, left: 8),
      child: Column(
        children: [
          Container(
            alignment: Alignment.centerRight,
            child: Text(
              'Stochastic یک اسیلاتور مومنتوم است. این یعنی اینکه با استفاده از این اسیلاتور سرعت حرکت قیمت را اندازه گیری میکنیم. بعنوان یک قانون به یاد داشته باشید که مومنتوم همیشه قبل از روند قیمت، تغییر جهت میدهد. در نتیجه مهمترین کاربرد این اسیلاتور تشخیص واگرایی ها است.' +
                  '\n' +
                  'از آنجایی که استوک استیک محدود به رنج 0 تا 100 است، میتوان از آن بعنوان دومین کاربرد این اسیلاتور در تشخیص محدوده‌های اشباع خرید/فروش نیز استفاده کرد. ' +
                  '\n' +
                  'از این اسیلاتور میتوان هم در بازارهای روند‌دار استفاده کرد و هم در بازارهای رنج و خنثی.' +
                  '\n',
              style: TextStyle(color: Colors.black),
            ),
          ),
          Padding(
            padding: const EdgeInsets.only(left: 25.0, bottom: 20, top: 10),
            child: Center(
              child: Image(
                image: AssetImage(
                    'assets/images/indicators/charts/stochasticChart.png'),
              ),
            ),
          ),
          Container(
            alignment: Alignment.centerRight,
            child: Text(
              'این اسیلاتور از دو خط K% و D% استفاده میکند. ' +
                  'استوک استیک سطح {کلوز کندل فعلی نسبت به پایین ترین قیمت} را در محدوده بین بالاترین و پایین‌ترین قیمت یک دوره زمانی (به صورت پیش فرض 14) اندازه‌گیری میکند. این سطح با %K نمایش داده میشود. برای مثال فرض کنید قیمت کلوز کندل جاری 108 باشد، بالاترین قیمت در 14 کندل قیل 110 و پایین‌ترین قیمت در 14 کندل قبل 100 باشد. در اینصورت میزان %K برایر با 80 میشود:' +
                  '\n' +
                  '%K = (Current Close - Lowest Low)/(Highest High - Lowest Low) * 100' +
                  '\n' +
                  '%k= (108-100) / (110-100) * 100 = 80' +
                  '\n' +
                  '%D نیز از طریق محاسبه میانگین متحرک ساده (به صورت پیش فرض 3) %K بدست می‌آید:' +
                  '\n' +
                  '%D = 3-day SMA of %K' +
                  '\n',
              style: TextStyle(color: Colors.black),
            ),
          ),
          Text(
            'برای دریافت سیگنال از طریق واگرایی باید از خط %D استفاده نمایید. واگرایی مثبت زمانی تایید میشود که یا یک سطح مقاومتی در نمودار قیمتی شکسته شود و یا اینکه استوک استیک به بالای محدوه 50 نفوذ کند. همچنین واگرایی منفی تایید میشود که یا یک سطح حمایتی در نمودار قیمت شکسته شود و یا استوک استیک خط 50 را شکسته و به سمت پایین حرکت کند.' +
                '\n' +
                'دریافت سیگنال در محدوه های اشباع به شکل زیر است:' +
                '\n' +
                'زمانی که خط K% خط D% را در محدوده 80 تا 100 (اشباع خرید) به سمت پایین قطع کند، سیگنال فروش می باشد و در صورتی که خط K% خط D% را در محدوده 0 تا 20 (اشباع فروش) به سمت بالا قطع کند، سیگنال خرید می باشد.' +
                '\n' +
                'به این نکته خیلی توجه داشته باشید که  به صرف اینکه استوک استیک در محدوده‌های اشباع شده قرار دارد به معنای بازگشت روند نیست و ممکن است روند قیمتی از چنان قدرتی برخوردار باشد که مدتها استوک استیک در محدوده اشباع قرار داشته باشد و حتی خروج از محدوده اشباع نیز به منزله اصلاح کوتاه مدت صورت پذیرد. در نتیجه در یک روند پر قدرت صعودی سیگنال‌های فروشی که در محدوده اشباع خرید صادر میشود را نادیده بگیرد و فقط به دنبال سیگنال‌های خرید در محدوده اشباع فروش باشید. در روند های پر قدرت نزولی نیز سیگنال های خریدی که در محدوده اشباع فروش صادر میشود را نادیده بگیرد و فقط به دنبال سیگنال‌های فروش در محدوده اشباع خرید باشید که البته این نکته در بازار یکطرفه بورس ایران بعنوان سیگنال برای ورود به معامله نیست و فقط هشداری است که میتواند از خرید اشتباه یک سهم جلوگیری کند.'
                    '\n',
            style: TextStyle(
              color: Colors.black,
            ),
          ),
        ],
      ),
    );
  }
}
