import 'package:flutter/material.dart';

class Wpr extends StatelessWidget {
  //final ScrollController _scrollController = ScrollController();
  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.only(right: 25.0, left: 8),
      child: Column(
        children: [
          Container(
            alignment: Alignment.centerRight,
            child: Text(
              'WPR مخفف عبارت Williams Percent Range است.' +
                  '\n' +
                  'WPR یک اسیلاتور مومنتوم است که سطح {کلوز کندل فعلی نسبت به بالاترین قیمت} را نسبت به بالاترین و پایینن ترین قیمت در یک دوره زمانی مشخص (به صورت پیش فرض 14) اندازه‌گیری میکند: ' +
                  '\n' +
                  '%R = (Highest High - Close) / (Highest High - Lowest Low) * (-100)' +
                  '\n'
                      'همانطور که مشاهده میکنید فرمول محاسباتی WPR بسیار شبیه به استوک استیک است. در واقع خروجی این اسیلاتور خطوطی کاملا شبیه با استوک استیک اما در مقیاسی متفاوت ایجاد میکند',
              style: TextStyle(color: Colors.black),
            ),
          ),
          Padding(
            padding: const EdgeInsets.only(left: 25.0, bottom: 20, top: 10),
            child: Center(
              child: Image(
                image:
                    AssetImage('assets/images/indicators/charts/wprChart.png'),
              ),
            ),
          ),
          Container(
            alignment: Alignment.centerRight,
            child: Text(
              'این اسیلاتور در محدوه 0 تا 100- در نوسان است. خط مرکزی 50- مهمترین سطح در این اسیلاتور است. در صورتی که خط مرکزی به سمت بالا شکسته شود نشان دهنده آن است که روند قیمتی تمایل به صعود دارد و بالعکس در صورتی که رو به پایین شکسته شود نشان دهنده آن است که روند قیمتی تمایل به نزولی شدن دارد.' +
                  '\n' +
                  'اگر اندیکاتور بین ۰ تا -۲۰ قرار داشته باشد، می‌توان گفت بازار وارد محدوده اشباع خرید شده است. اگر اندیکاتور بین سطوح ۸۰- تا ۱۰۰- نوسان کند، نشانگر ورود دارایی به محدوده اشباع فروش است.' +
                  '\n' +
                  'به این نکته توجه داشته باشید که تداوم حضور WPR در محدوده اشباع فروش لزوما به معنای شروع بازاز صعودی نیست؛ همچنین حضور WPR در محدوده اشباع خرید به معنای شروع روند نزولی نیست. ممکن است روند قیمتی از چنان قدرتی برخوردار باشد که مدتها WPR در محدوده اشباع قرار داشته باشد و حتی خروج از محدوده اشباع نیز به منزله اصلاح کوتاه مدت صورت پذیرد.' +
                  '\n' +
                  'اهمیت خط مرکزی در اینجا نمایان مشود. بعد از خروج WPR از محدوده اشباع در صورتی میتوان وارد یک معامله امن شد که خط مرکزی 50- نیز شکسته شود. علاوه بر این برای تایید بیشتر میتوان منتظر شکست مقاومت در شروع یک حرکت صعودی و یا از دست رفتن یک حمایت در شروع یک روند نزولی بود. '
                      '\n' +
                  'از این اسیلاتور میتوان برای تعیین روند در تایم فریم های بالاتر مثل تایم فریم های سه ماه و شش ماهه نیز استفاده کرد. در صورتی که WPR بین 50- تا 0 باشد روند صعودی و در صورتی که بین 50- تا 100- باشد روند نزولی است.' +
                  '\n' +
                  'شاخص WPR را با %R نمایش میدهند.' +
                  '\n' +
                  'واچ لیست ارائه شده، نمادهایی که خط مرکزی را به سمت بالا شکسته، نمایش میدهد. لطفا با رعایت  موارد ذکر شده در بالا وارد یک معامله امن شوید.',
              style: TextStyle(
                color: Color(0xff085479),
              ),
            ),
          ),
        ],
      ),
    );
  }
}
