import 'package:flutter/material.dart';

class SmartMoneyOutflow extends StatelessWidget {
  //final ScrollController _scrollController = ScrollController();
  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.only(right: 25.0, left: 8),
      child: Text(
        'با استفاده از این فیلتر نمادهایی که دارای شرایط زیر باشند را نمایش میدهیم:' +
            '\n\n' +
            '1- نمادهایی که بیشتر از 60 درصد از روزهای (یکماه اخیر و یا دو هفته اخیر و یا یک هفته اخیر) را  مثبت سپری کردند.' +
            '\n' +
            '2- حجم معاملاتی مشکوک مشاهده شود.' +
            '\n' +
            '3- قدرت فروشنده: سرانه فروش هر فرد حقیقی حداقل 2 برابر سرانه خرید هر فرد حقیقی باشد.' +
            '\n' +
            'سرانه فروش حقیقی: مجموع حجم فروش حقیقی تقسیم بر تعداد فروشنده حقیقی\n' +
            'سرانه خرید حقیقی: مجموع حجم خرید حقیقی تقسیم بر تعداد خریدار حقیقی'
                '\n\n' +
            'برای اطمینان بیشتر میتوانید موارد زیر را هم بررسی بفرمایید:' +
            '\n' +
            '- آخرین قیمت منفی و کمتر از قیمت پایانی باشد. ' +
            '\n' +
            '- انتقال از حقیقی به حقوقی بیش تر از 20 درصد حجم معاملات روز جاری باشد. ' +
            '\n' +
            '- حجم خرید حقوقی از حجم فروش حقوقی بیشتر باشد. ',
        style: TextStyle(color: Colors.black),
      ),
    );
  }
}
