import 'package:flutter/material.dart';

class SEE extends StatelessWidget {
  //final ScrollController _scrollController = ScrollController();
  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.only(right: 25.0, left: 8),
      child: Column(
        children: [
          Text(
            'این سیستم یکی از استراتژی‌های اولیه در بازارهای سرمایه است که در تایم فریم روزانه مورد استفاده قرار می‌گیرد. ' +
                'در این استراتژی از دو مووینگ اوریج نمایی با دوره‌های زمانی 2 و 5 روزه به همراه اسیلاتور استوک‌استیک استفاده میشود.' +
                '\n' +
                'سیگنال خرید زمانی صادر میشود که مووینگ اوریج نمایی 2 روزه از پایین مووینگ اوریج نمایی 5 روزه را به سمت بالا بشکند، در حالی که خط اصلی اندیکاتور استوک‌استیک به سمت بالا و بین 20 تا 50 باشد.',
            style: TextStyle(color: Colors.black),
          ),
          Padding(
            padding: const EdgeInsets.only(left: 25.0, bottom: 20, top: 10),
            child: Center(
              child: Image(
                image:
                    AssetImage('assets/images/strategies/charts/SEEchart.png'),
              ),
            ),
          ),
          Text(
            'نقطه ورود به معامله در کندل بعد است، زمانی که قیمت بالاتر از High کندل قبلی قرار بگیرد.' +
                '\n' +
                'نقطه خروج از معامله هم زمانی صادر میشود که یا مووینگ اوریج 5 روزه از بالا مووینگ اوریج 2 روزه را به سمت پایین بشکند و یا اینکه اسیلاتور استواستیک وارد محدوده اشباع خرید یا اشباع فروش شود. البته به نظر من وقوع کندل قرمز نزولی بزرگترین هشدار برای خروج از معامله است.' +
                '\n' +
                'نقطه استاپ لاست شما میتواند Low کندلی باشد که در آن  سیگنال خرید صادر شده است. توجه داشته باشید که نسبت ریسک به ریوارد برای معامله‌گران کوتاه مدت حداقل باید 1:2 باشد. البته حالت بهینه‌تر و مطلوب نسبت 1:3 است.' +
                '\n' +
                'توصیه میکنم برای این روش معملاتی، خرید خود را بین ساعت 12 تا 12:30 دقیقه انجام دهید تا مطمین شوید که قیمت از قیمت High کندل قبل پایین‌تر نمیرود. همچنین قبل از خرید مطمین شوید که قیمت Low از قیمت Low کندل قبل بالاتر باشد.' +
                '\n' +
                'نکته بسیار بسیار مهم دیگر این است که فقط زمانی وارد معامله خرید شوید که روند اصلی نماد صعودی باشد. در غیر اینصورت احتمال اینکه وارد ضرر شوید بسیار زیاد است. ' +
                '\n' +
                'در ضمن سیگنال‌هایی که در ادامه معرفی میشود، با در نظر گرفتن نسبت ریسک به ریوارد 1:2 و البته بدون در نظر گرفتن فاکتور روند حرکتی نماد است.',
            style: TextStyle(color: Colors.black),
          ),
        ],
      ),
    );
  }
}
